
/******************** (C) COPYRIGHT  奇来科技 *************************************
 * 文件名  ：delay_time.c
 * 描述    ：延时函数
 * 实验平台： STM8开发板
 * 库版本  ：V1.0.0
 * 技术支持：lijinnan@qiqirobot.com
 * 修改时间：2016-08-25
 * 淘宝网址：https://lsqrd.taobao.com/index.htm?spm=2013.1.w5002-7895914584.2.kYLHaf
**********************************************************************************/

#include "type_def.h"
#include "delay.h"
#include "timer.h"

/**********************************************************************************************************
*   函 数 名: delay_us
*   功能说明: 微秒延时程序
*   形    参：nCount要延时的微秒数
*   返 回 值: 无
**********************************************************************************************************/
void delay_us(u16 nCount)
{
    nCount *= 3;

    while (--nCount);
}

/**********************************************************************************************************
*   函 数 名: delay_ms
*   功能说明: 毫秒延时程序
*   形    参：nCount要延时的毫米数
*   返 回 值: 无
**********************************************************************************************************/
void delay_ms(u16 nCount)
{
#ifdef CONFIG_DELAY_NOP

    while (nCount--)
    {
        delay_us(1000);
    }

#else
    uint32_t t = Sys_Time + nCount;

    while (Sys_Time < t)delay_us(10);

#endif
}


/******************* (C) COPYRIGHT 奇来科技 *****END OF FILE****/