/*
 * @Author: zhouli
 * @Date: 2020-04-04 15:28:44
 * @LastEditTime: 2020-04-06 23:35:00
 * @Description: delay function
 */

#include "type_def.h"
#include "delay.h"
#include "timer.h"

/**********************************************************************************************************
*   函 数 名: delay_us
*   功能说明: 微秒延时程序
*   形    参：nCount要延时的微秒数
*   返 回 值: 无
**********************************************************************************************************/
void delay_us(u16 nCount)
{
    nCount *= 3;

    while (--nCount);
}

/**********************************************************************************************************
*   函 数 名: delay_ms
*   功能说明: 毫秒延时程序
*   形    参：nCount要延时的毫米数
*   返 回 值: 无
**********************************************************************************************************/
void delay_ms(u16 nCount)
{
#ifdef CONFIG_DELAY_NOP

    while (nCount--)
    {
        delay_us(1000);
    }

#else
    uint32_t t = Sys_Time + nCount;

    while (Sys_Time < t)delay_us(10);

#endif
}


/******************* (C) COPYRIGHT 奇来科技 *****END OF FILE****/