/******************** (C) COPYRIGHT  风驰iCreate嵌入式开发工作室 ***************************
 * 文件名  ：led.c
 * 描述    ：IO口配置函数库   
 * 实验平台：iCreate STM8开发板
 * 寄存器版本  ：V2.0.0
 * 作者    ：ling_guansheng  QQ：779814207
 * 博客    ：
 * 修改时间 ：2011-12-20

 * iCreate STM8开发板硬件连接
    |--------------------|
    |  LED-PD0           |
    |--------------------|

****************************************************************************************/
#include "type_def.h"
#include "led.h"
#include "delay.h"
#include "pwm.h"

/**************************************************************************
 * 函数名：LED_conf
 * 描述  ：STM8开发板上与LED相连接引脚初始化
 * 输入  ：无
 *
 * 输出  ：无
 * 返回  ：无
 * 调用  ：外部调用
 *************************************************************************/
void LED_conf(void)
{
  PC_DDR|=0x0f<<1;   /* 设置数据方向寄存器 1为输出，0为输入--查看STM8寄存器.pdf P87 */
  PC_CR1|=0x0f<<1;   /* 设置推挽输出--查看STM8寄存器.pdf P88 */
  PC_CR2|=0x0f<<1;   /* 设置输出频率 1为10M，0为2M--查看STM8寄存器.pdf P89 */
  
  PWM_Init();
  PWM_Open();
  SetTIM1_PWM_DutyCycle('L',0);
  SetTIM1_PWM_DutyCycle('R',0);
  SetTIM1_PWM_DutyCycle('G',0);
  SetTIM1_PWM_DutyCycle('B',0);
}




/******************* (C) COPYRIGHT 风驰iCreate嵌入式开发工作室 *****END OF FILE****/